Revit 2026 API

# Path3dAllCurveLoops Property

---

Get all the Curve Loops of Path3d.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveArrArray AllCurveLoops { get; }
```
```vb
Public ReadOnly Property AllCurveLoops As CurveArrArray
	Get
```
```cpp
public:
property CurveArrArray^ AllCurveLoops {
	CurveArrArray^ get ();
}
```
```fsharp
member AllCurveLoops : CurveArrArray with get
```

#### Property Value

CurveArrArray

Returns all the Curve Loops of Path3d.

#### Reference

Path3d Class

Autodesk.Revit.DB Namespace